WELCOME = """
<b>👋 Привет!</b>
Я помогу скачать тебе любой материал с самых популярных стоков

💡Для того чтобы скачать файл,
нажми на кнопку "Скачать" с
названием нужного тебе
сервиса, например "Скачать с
Envato" и следуй инструкциям!

📢 Не пропусти обновления и бонусы — <a href="https://t.me/+HVUoctN58uc3ZDYy">подпишись на канал</a>

🧭 <a href="https://t.me/+HVUoctN58uc3ZDYy">Инструкция</a> как пользоваться ботом
"""

APPLY_DOWNLOAD = """
✅ <b>Отлично, ты выбрал Envato Elements.</b>

Теперь отправь мне сообщение
со ссылкой на нужный тебе
файл

Пример ссылки: https://
elements\u200b.\u200benvato\u200b.\u200bcom/ru/
breathtaking-valley-nature-
landscape-YFR4FBV

У тебя осталось {credit} бесплатные 
загрузки
"""

CANCLE_DOWNLOAD = """
❌ <b>К сожалению у тебя
закончились бесплатные
скачивания</b>

Для продолжения скачивания файлов
необходимо купить
подписку - для этого нажми на
"Оплата 💳" и выбери нужный
тебе сервис
"""

BAD_URL = """
❌<b>Некорректная ссылка!</b>

Проверь, чтобы ссылка из
браузера была полностью
скопирована, а затем вновь
отправь её мне.

вот пример правильной ссылки:
https://\u200belements\u200b.\u200benvato\u200b.\u200bcom/ru/
breathtaking-valley-nature-
landscape-YFR4FBV

Либо нажми на кнопку
“Посмотреть инструкцию”
"""

DOWNLOAD_FILE = """
Для загрузки файла на
устройство нажми на "Cкачать
файл 📁"

Ссылка для загрузки будет
доступна в течении минуты

Если понадобиться скачать ещё
- просто отправь мне ссылку на
нужный тебе файл

<b>Доступных загрузок сегодня: 2</b>
"""

WAITING = """
⌛ Я нашел нужный тебе файл и
начал его качать, пожалуйста
ожидай
"""

CHANEL_CHECK = """
<b>Получи 2 бесплатных
скачивания за подписку на наш
канал с новостями и
обновлениями</b>

Нажми на “подписаться” и
после подписки на канал нажми
на “проверить подписку”
"""

CHANEL_APPLY = """
✅  <b>Подписка подтверждена!</b>

Для скачивания файлов выбери
ниже нужный тебе сервис и
нажми на “Скачать” с его
названием
"""


CHANEL_CANCLE = """
❌ Ты всё ещё не подписан на
наш <a href="https://t.me/+HVUoctN58uc3ZDYy">канал</a>, нажми на
“подписаться”, а затем на
“Проверить подписку”
"""

FREEPIK = """
🛠️ <b>К сожалению данная
функция находится в
разоботке, но уже скоро она
появится в боте.</b>

Чтобы не пропустить новость
подпишись на наш <a href="https://t.me/+HVUoctN58uc3ZDYy">канал</a> и
следи за обновлениями!
"""